app/controllers/resumes_controller.rb

SELECT `resumes`.* FROM `resumes`
---
  def index
    @resumes = Resume.all

INSERT INTO `resumes` (`name`, `attachment`, `created_at`, `updated_at`) VALUES ('sanjeev', 'Article-Image.png', '2016-08-22 11:32:34', '2016-08-22 11:32:34')
---
  def create
    @resume = Resume.new(resume_params)
     puts @resume.attachment.url
    if @resume.save

SELECT  `resumes`.* FROM `resumes` WHERE `resumes`.`id` = 1 LIMIT 1
DELETE FROM `resumes` WHERE `resumes`.`id` = 1
---
  def destroy
    @resume = Resume.find(params[:id])
    @resume.destroy